app/controllers/comments_controller.rb

	 def create

		@post = Post.find(params[:post_id])

		@comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "asdfasdfa"], ["commenter", "zdcff"], ["created_at", Wed, 07 May 2014 21:30:04 UTC +00:00], ["post_id", 2], ["updated_at", Wed, 07 May 2014 21:30:04 UTC +00:00]]