app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", ":(:(:(:("], ["updated_at", Wed, 23 Apr 2014 19:48:15 UTC +00:00]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :text))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 16 Apr 2014 19:21:35 UTC +00:00], ["text", "chao"], ["title", "Ho"], ["updated_at", Wed, 16 Apr 2014 19:21:35 UTC +00:00]]
---
	def create

  		@post = Post.new(params[:post].permit(:title, :text))

      if @post.save